****************PSM-DID*********************
*****DID的stata操作
*手动计算：
cd e:\data
use cardkrueger1994,clear
gen gd = t*treated 
reg fte gd treated t,r
reg fte gd treated t bk kfc roys,r
*diff命令：
diff fte,t(treated) p(t) robust
diff fte,t(treated) p(t) cov(bk kfc roys) robust
diff fte,t(treated) p(t) cov(bk kfc roys) robust test

*****双重差分倾向得分匹配
cd e:\data
use cardkrueger1994,clear
diff fte,t(treated) p(t) kernel id(id) logit cov(bk kfc roys) report support
//结果如下：
//倾向得分的计算：
Logistic regression                               Number of obs   =        404
                                                LR chi2(3)      =       2.91
                                                Prob > chi2     =     0.4053
Log likelihood =  -196.7636                       Pseudo R2       =     0.0073

------------------------------------------------------------------------------
   treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          bk |   .3108387   .3561643     0.87   0.383    -.3872306    1.008908
         kfc |   .6814511   .4335455     1.57   0.116    -.1682824    1.531185
        roys |    .520356   .4011747     1.30   0.195     -.265932    1.306644
       _cons |    1.05315   .2998708     3.51   0.000      .465414    1.640886
------------------------------------------------------------------------------
* 倾向得分匹配后双重差分：
Number of observations in the DIFF-IN-DIFF: 795
            Before         After    
   Control: 78             76          154
   Treated: 326            315         641
            404            391
--------------------------------------------------------
 Outcome var.   | fte     | S. Err. |   |t|   |  P>|t|
----------------+---------+---------+---------+---------
Before          |         |         |         | 
   Control      | 20.040  |         |         | 
   Treated      | 17.065  |         |         | 
   Diff (T-C)   | -2.975  | 0.943   | -3.16   | 0.002***
After           |         |         |         | 
   Control      | 17.449  |         |         | 
   Treated      | 17.499  |         |         | 
   Diff (T-C)   | 0.050   | 0.955   | 0.05    | 0.958
                |         |         |         | 
Diff-in-Diff    | 3.026   | 1.342   | 2.25    | 0.024**
--------------------------------------------------------

**********STATA进行PSM-DID（摘自知乎：https://zhuanlan.zhihu.com/p/498852964）

// 0. 数据导入，导入自带数据集：
cd "/Users/zhulu/Files/data"
use nlswork.dta,clear
// 1. 前期处理
* 设置面板：
xtset idcode year, delta(1)

       panel variable:  idcode (unbalanced)
        time variable:  year, 68 to 88, but with gaps
                delta:  1 unit

* 变量加工与描述性统计：
xtdescribe 
g age2= age^2
g ttl_exp2=ttl_exp^2
g tenure2=tenure^2
global xlist "grade age age2 ttl_exp ttl_exp2 tenure tenure2 not_smsa south race"
sum ln_w $xlist 

// 2. 传统DID
* 在这个数据集中，政策执行时间为1977年，因此设置：
g time = (year >= 77) & !missing(year) 

* 而政策执行地方为idcode大于2000的地方，因此设置：
g treated = (idcode >2000)&!missing(idcode) 

* 生成政策变量：
g did = time*treated 

* 采用OLS估计：
reg ln_w did time treated $xlist 


      Source |       SS           df       MS      Number of obs   =    28,091
-------------+----------------------------------   F(13, 28077)    =   1295.76
       Model |  2405.08413        13  185.006471   Prob > F        =    0.0000
    Residual |  4008.77975    28,077  .142778066   R-squared       =    0.3750
-------------+----------------------------------   Adj R-squared   =    0.3747
       Total |  6413.86388    28,090  .228332641   Root MSE        =    .37786

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         did |   .0124603   .0094099     1.32   0.185    -.0059836    .0309042
        time |  -.0694754   .0097324    -7.14   0.000    -.0885513   -.0503996
     treated |  -.0142815   .0078374    -1.82   0.068    -.0296431    .0010801
       grade |   .0633445   .0010293    61.54   0.000      .061327     .065362
         age |   .0484968   .0036834    13.17   0.000     .0412771    .0557165
        age2 |  -.0008259   .0000583   -14.18   0.000    -.0009401   -.0007117
     ttl_exp |   .0250849    .002395    10.47   0.000     .0203906    .0297793
    ttl_exp2 |   .0002872   .0001266     2.27   0.023      .000039    .0005353
      tenure |   .0460783    .001968    23.41   0.000     .0422209    .0499356
     tenure2 |  -.0019604   .0001341   -14.62   0.000    -.0022233   -.0016976
    not_smsa |  -.1686808   .0051713   -32.62   0.000    -.1788169   -.1585447
       south |  -.1017625   .0055672   -18.28   0.000    -.1126745   -.0908504
        race |  -.0528909   .0049329   -10.72   0.000    -.0625597   -.0432221
       _cons |   .1400083   .0535917     2.61   0.009     .0349661    .2450506
------------------------------------------------------------------------------

* 固定效应模型：
xtreg ln_w did time treated $xlist i.year, fe

Fixed-effects (within) regression               Number of obs     =     28,091
Group variable: idcode                          Number of groups  =      4,697

R-sq:                                           Obs per group:
     within  = 0.1781                                         min =          1
     between = 0.3576                                         avg =        6.0
     overall = 0.2666                                         max =         15

                                                F(23,23371)       =     220.25
corr(u_i, Xb)  = 0.1840                         Prob > F          =     0.0000

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         did |    .019761    .008746     2.26   0.024     .0026182    .0369037
        time |  -.3296955   .2012367    -1.64   0.101    -.7241326    .0647416
     treated |          0  (omitted)
       grade |          0  (omitted)
         age |   .0665613   .0105138     6.33   0.000     .0459536    .0871689
        age2 |  -.0009369   .0000616   -15.20   0.000    -.0010577    -.000816
     ttl_exp |   .0392161    .003072    12.77   0.000     .0331947    .0452375
    ttl_exp2 |  -.0001047   .0001352    -0.77   0.439    -.0003697    .0001603
      tenure |   .0338566   .0018579    18.22   0.000     .0302151    .0374981
     tenure2 |  -.0018164    .000126   -14.42   0.000    -.0020633   -.0015695
    not_smsa |   -.086641   .0095117    -9.11   0.000    -.1052846   -.0679974
       south |  -.0597302   .0109246    -5.47   0.000    -.0811431   -.0383173
        race |          0  (omitted)
             |
        year |
         69  |   .0423343    .015528     2.73   0.006     .0118984    .0727702
         70  |  -.0339863    .022938    -1.48   0.138    -.0789464    .0109737
         71  |  -.0299658   .0318704    -0.94   0.347     -.092434    .0325023
         72  |  -.0584678   .0412716    -1.42   0.157    -.1393627    .0224272
         73  |  -.0961513   .0508379    -1.89   0.059     -.195797    .0034943
         75  |  -.1513149   .0698104    -2.17   0.030    -.2881479   -.0144818
         77  |   .1558488   .1129486     1.38   0.168    -.0655379    .3772354
         78  |   .1417381   .1027217     1.38   0.168    -.0596031    .3430793
         80  |   .0826885   .0834407     0.99   0.322    -.0808607    .2462377
         82  |   .0268096   .0638067     0.42   0.674    -.0982557     .151875
         83  |   .0103961    .054166     0.19   0.848    -.0957727     .116565
         85  |    .007777   .0347411     0.22   0.823    -.0603178    .0758717
         87  |  -.0223798   .0162763    -1.37   0.169    -.0542825    .0095229
         88  |          0  (omitted)
             |
       _cons |   .5038214   .1945871     2.59   0.010     .1224179    .8852249
-------------+----------------------------------------------------------------
     sigma_u |   .3532234
     sigma_e |   .2898202
         rho |  .59764928   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4696, 23371) = 6.58                 Prob > F = 0.0000

// 3. PSM-DID
* 定义种子：
set seed 0001

* 生成随机数并随机整理：
g tmp = runiform()
sort tmp 

* 近邻匹配：
psmatch2 treated $xlist, out(ln_w) logit ate neighbor(1) common caliper(.05) ties 

Logistic regression                             Number of obs     =     28,091
                                                LR chi2(10)       =   10093.80
                                                Prob > chi2       =     0.0000
Log likelihood =  -13636.63                     Pseudo R2         =     0.2701

------------------------------------------------------------------------------
     treated |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       grade |  -.0342869   .0070082    -4.89   0.000    -.0480227   -.0205511
         age |   .1726049   .0227237     7.60   0.000     .1280673    .2171424
        age2 |  -.0026816   .0003693    -7.26   0.000    -.0034054   -.0019577
     ttl_exp |  -.0681925   .0155242    -4.39   0.000    -.0986193   -.0377657
    ttl_exp2 |   .0040423   .0008363     4.83   0.000     .0024031    .0056815
      tenure |  -.0138884   .0128354    -1.08   0.279    -.0390453    .0112686
     tenure2 |   .0002263   .0008671     0.26   0.794    -.0014733    .0019259
    not_smsa |   .4024444   .0355904    11.31   0.000     .3326885    .4722002
       south |   2.865226   .0409688    69.94   0.000     2.784928    2.945523
        race |   .7655284    .034012    22.51   0.000     .6988662    .8321907
       _cons |  -3.400584   .3254663   -10.45   0.000    -4.038487   -2.762682
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
         ln_wage  Unmatched | 1.62754443   1.75722818  -.129683748   .005816206   -22.30
                        ATT | 1.62798811   1.70873922  -.080751107   .021132148    -3.82
                        ATU | 1.75707925   1.75230645  -.004772802            .        .
                        ATE |                          -.051698588            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         2     10,733 |    10,735 
   Treated |        20     17,336 |    17,356 
-----------+----------------------+----------
     Total |        22     28,069 |    28,091 

* 检验协变量在处理组与控制组之间是否平衡：

pstest $xlist, both graph

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
grade                  U  | 12.341   12.853    -22.3         | -18.01  0.000 |  1.18*
                       M  | 12.348   12.645    -12.9    42.1 | -12.03  0.000 |  1.15*
                          |                                  |               |
age                    U  | 29.223   28.848      5.6         |   4.56  0.000 |  0.94*
                       M  | 29.216   30.875    -24.7  -342.5 | -23.65  0.000 |  1.05*
                          |                                  |               |
age2                   U  |  897.8   878.68      4.7         |   3.86  0.000 |  0.95*
                       M  | 897.33   994.81    -24.1  -409.7 | -22.80  0.000 |  1.01
                          |                                  |               |
ttl_exp                U  | 6.2403   6.2447     -0.1         |  -0.08  0.938 |  1.05*
                       M  | 6.2334   6.9942    -16.4-17031.2 | -14.80  0.000 |  0.92*
                          |                                  |               |
ttl_exp2               U  | 61.008   60.008      1.2         |   1.01  0.312 |  1.03
                       M  | 60.849   72.756    -14.8 -1090.6 | -12.91  0.000 |  0.79*
                          |                                  |               |
tenure                 U  | 3.0891   3.1782     -2.4         |  -1.93  0.053 |  0.96*
                       M  | 3.0899   2.9777      3.0   -25.9 |   2.87  0.004 |  1.10*
                          |                                  |               |
tenure2                U  |  23.41   24.482     -1.9         |  -1.60  0.110 |  0.90*
                       M  | 23.423   21.518      3.5   -77.7 |   3.41  0.001 |  1.14*
                          |                                  |               |
not_smsa               U  | .32945   .20689     27.9         |  22.36  0.000 |     .
                       M  | .32897   .32066      1.9    93.2 |   1.65  0.099 |     .
                          |                                  |               |
south                  U  |   .618   .07219    140.2         | 107.35  0.000 |     .
                       M  | .61756   .61802     -0.1    99.9 |  -0.09  0.930 |     .
                          |                                  |               |
race                   U  | 1.3912   1.1631     50.3         |  39.53  0.000 |  1.91*
                       M  | 1.3896   1.3763      2.9    94.2 |   2.43  0.015 |  1.05*
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.97; 1.03] for U and [0.97; 1.03] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.272  10149.10    0.000     25.7       5.2     145.8*   3.70*    88
 Matched   | 0.019    932.83    0.000     10.4       8.2      33.1*   1.16     88
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

* 去掉不满足共同区域假定的观测值：
gen common=_support
drop if common == 0 

* 根据上面匹配好的数据，进行DID。
* 首先是OLS：

reg ln_w did time treated $xlist 

      Source |       SS           df       MS      Number of obs   =    28,069
-------------+----------------------------------   F(13, 28055)    =   1294.85
       Model |  2402.32966        13  184.794589   Prob > F        =    0.0000
    Residual |   4003.8761    28,055  .142715241   R-squared       =    0.3750
-------------+----------------------------------   Adj R-squared   =    0.3747
       Total |  6406.20576    28,068  .228238769   Root MSE        =    .37778

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         did |   .0130378   .0094101     1.39   0.166    -.0054064    .0314821
        time |   -.069613   .0097317    -7.15   0.000    -.0886876   -.0505384
     treated |  -.0145157    .007837    -1.85   0.064    -.0298765    .0008452
       grade |   .0635306   .0010326    61.53   0.000     .0615067    .0655545
         age |   .0487295   .0036856    13.22   0.000     .0415054    .0559535
        age2 |  -.0008306   .0000583   -14.24   0.000    -.0009449   -.0007163
     ttl_exp |   .0246821   .0023991    10.29   0.000     .0199798    .0293843
    ttl_exp2 |   .0003217   .0001271     2.53   0.011     .0000726    .0005708
      tenure |   .0461767   .0019693    23.45   0.000     .0423168    .0500365
     tenure2 |  -.0019786   .0001343   -14.73   0.000    -.0022419   -.0017154
    not_smsa |  -.1681968   .0051738   -32.51   0.000    -.1783376    -.158056
       south |   -.101765   .0055661   -18.28   0.000    -.1126748   -.0908551
        race |  -.0534454   .0049452   -10.81   0.000    -.0631381   -.0437526
       _cons |   .1361316   .0536086     2.54   0.011     .0310562    .2412069
------------------------------------------------------------------------------

* 然后是固定效应模型：
xtreg ln_wage did time treated $xlist i.year, fe

Fixed-effects (within) regression               Number of obs     =     28,069
Group variable: idcode                          Number of groups  =      4,696

R-sq:                                           Obs per group:
     within  = 0.1782                                         min =          1
     between = 0.3585                                         avg =        6.0
     overall = 0.2678                                         max =         15

                                                F(23,23350)       =     220.19
corr(u_i, Xb)  = 0.1861                         Prob > F          =     0.0000

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         did |   .0199922   .0087501     2.28   0.022     .0028414     .037143
        time |  -.3259785   .2014472    -1.62   0.106    -.7208281    .0688712
     treated |          0  (omitted)
       grade |          0  (omitted)
         age |   .0664258   .0105214     6.31   0.000     .0458031    .0870485
        age2 |  -.0009367   .0000617   -15.18   0.000    -.0010576   -.0008158
     ttl_exp |   .0388635   .0030813    12.61   0.000     .0328238    .0449031
    ttl_exp2 |  -.0000845   .0001359    -0.62   0.534    -.0003508    .0001819
      tenure |   .0339768   .0018608    18.26   0.000     .0303295    .0376241
     tenure2 |  -.0018292   .0001263   -14.48   0.000    -.0020768   -.0015817
    not_smsa |  -.0865921   .0095179    -9.10   0.000    -.1052478   -.0679365
       south |  -.0600416   .0109379    -5.49   0.000    -.0814807   -.0386026
        race |          0  (omitted)
             |
        year |
         69  |   .0425357   .0155411     2.74   0.006     .0120741    .0729974
         70  |  -.0332855   .0229601    -1.45   0.147    -.0782887    .0117178
         71  |  -.0290703    .031901    -0.91   0.362    -.0915985    .0334578
         72  |  -.0573452   .0413132    -1.39   0.165    -.1383217    .0236314
         73  |  -.0947357   .0508901    -1.86   0.063    -.1944837    .0050123
         75  |  -.1496357   .0698826    -2.14   0.032    -.2866102   -.0126612
         77  |   .1540973   .1130656     1.36   0.173    -.0675187    .3757134
         78  |    .140131   .1028285     1.36   0.173    -.0614196    .3416817
         80  |    .081445   .0835287     0.98   0.330    -.0822767    .2451668
         82  |   .0260429   .0638735     0.41   0.683    -.0991533     .151239
         83  |   .0097373   .0542219     0.18   0.857    -.0965412    .1160159
         85  |    .007336   .0347776     0.21   0.833    -.0608304    .0755023
         87  |  -.0225526   .0162929    -1.38   0.166    -.0544878    .0093826
         88  |          0  (omitted)
             |
       _cons |   .5068104   .1947252     2.60   0.009     .1251361    .8884847
-------------+----------------------------------------------------------------
     sigma_u |   .3531224
     sigma_e |  .28988636
         rho |  .59740195   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4695, 23350) = 6.56                 Prob > F = 0.0000

// 4. DID的条件检验
// 4.1 共同趋势假设
* 生成年度虚拟变量

tab year, g(yrdum) 

  interview |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
         68 |      1,375        4.82        4.82
         69 |      1,232        4.32        9.14
         70 |      1,686        5.91       15.05
         71 |      1,851        6.49       21.53
         72 |      1,693        5.93       27.47
         73 |      1,981        6.94       34.41
         75 |      2,141        7.50       41.91
         77 |      2,171        7.61       49.52
         78 |      1,964        6.88       56.40
         80 |      1,847        6.47       62.88
         82 |      2,085        7.31       70.18
         83 |      1,987        6.96       77.15
         85 |      2,085        7.31       84.45
         87 |      2,164        7.58       92.04
         88 |      2,272        7.96      100.00
------------+-----------------------------------
      Total |     28,534      100.00

* 生成政策实行前的那些年份与处理虚拟变量的交互项
forval v=1/7{
g treated`v'=yrdum`v'*treated
}

/* 做三个回归：
第一列：没有控制变量
第二列：如果did依然显著，且treated*这些政策施行前年份交互项并不显著，那就好,did = time * treated
第三列：工会会影响这个处理组和控制组的共同趋势，因此看看union=0的情形
*/
xtreg ln_w did treated*  i.year ,fe  
outreg2 using result_1.doc,replace tstat bdec(3) tdec(2) ctitle(ln_w,Full-sample)addtext(Controls, No,Year Effect, Yes) keep(did treated*)
xtreg ln_w did treated* $xlist i.year ,fe 
outreg2 using result_1.doc,append tstat bdec(3) tdec(2) ctitle(ln_w,Full-sample)addtext(Controls, Yes,Year Effect, Yes) keep(did treated*)
xtreg ln_w did treated* $xlist i.year if union!=1 ,fe 
outreg2 using result_1.doc,append tstat bdec(3) tdec(2) ctitle(ln_w,union=0)addtext(Controls, Yes,Year Effect, Yes) keep(did treated*)

// 4.2 政策干预时间的随机性
* 将政策执行时间分别提前到1975年和1976年，重新构造DID变量：

g time1 = (year >= 75) & !missing(year)
g treated_1= (idcode >2000)&!missing(idcode)
g did1 = time1*treated_1
g time2 = (year >= 76) & !missing(year)
g treated_2= (idcode >2000)&!missing(idcode)
g did2 = time2*treated_2 
* 回归结果：
xtreg ln_w did1 $xlist i.year,fe 
outreg2 using result_2.doc,replace tstat bdec(3) tdec(2) ctitle(ln_w,Full-sample)addtext(Controls, Yes,Year Effect, Yes) keep(did*)
xtreg ln_w did2 $xlist i.year,fe 
outreg2 using result_2.doc,append tstat bdec(3) tdec(2) ctitle(ln_w,Full-sample)addtext(Controls, Yes,Year Effect, Yes) keep(did*)

// 4.3 控制组将不受政策影响
* 考虑一个并没有受政策影响地方假设其受到政策影响的情况：

g time = (year >= 77) & !missing(year)  
g treated_3= (idcode<1600 & idcode>1000)&!missing(idcode) 
g did3 = time*treated_3 
xtreg ln_w did3 $xlist i.year,fe

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        did3 |   .0047208   .0137331     0.34   0.731     -.022197    .0316387
...
* did3不显著，证明控制组不受政策影响。符合预期。

// 4.4 政策实施的唯一性
* 至少证明这个政策才是主要影响因素。需要寻找某些受到其他政策影响的地方：

g time4 = (year >= 77) & !missing(year)  
g treated_4= (idcode<3000 & idcode>2300)&!missing(idcode)
g did4 = time4*treated_4  
xtreg ln_w did4 $xlist i.year,fe 

------------------------------------------------------------------------------
     ln_wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        did4 |   -.009966   .0129562    -0.77   0.442     -.035361    .0154289
...
* 这里did4不显著，可以证明政策实施的唯一性。但有时候did4可能依然显著，但是系数变小，证明还受到其他政策影响。

// 4.5 控制组和政策影响组的分组是随机的
* 用工具变量来替代政策变量，解决因为分组非随机导致的内生性问题：

xi:xtivreg2 ln_w (did=hours tenure) $xlist i.year,fe first 


**************另一个DID教程（参考知乎：https://zhuanlan.zhihu.com/p/353712655?utm_medium=social&utm_oi=904678844856938496）
cd "/Users/zhulu/Files/data"
// 2 双重差分模型入门案例——最低工资法能否会降低对低技能工人的需求？

/* 1992年4月，新泽西州通过最低工资法案，将最低工资成4.25美元提高到5.05美元，而相邻的宾夕法尼亚州的最低工资却保持不变。
Card and Kruger[1]考虑了一个自然实验，即将新泽西州作为实验组，而宾州作为控制组，收集了两州不同快餐店在实施新
法前后前后雇佣人数的数据，并采用双重差分法进行估计。
   该数据集共包含522家快餐，并涉及两个时期（1992年2月和1992年11月，以t表示，分别赋值为0和1）。treated用以区分实验
组和控制组，其中1表示新泽西，0表示宾州。因变量为fte（full time employment），用以刻画快餐店的雇佣人数。数据集
还包括其余4个控制变量，均为快餐店的品牌，包括bk（Burger King），kfc（Kentuky Fried Chiken ），
roys（Roy Rogers），wendys（Wendy's）。
*/

* 首先我们先定义t和treated的交互项，并用进行双重差分估计：

 use CardKrueger1994.dta,clear
 * 生成实验组和法案实施时期的交互项
 gen did = t*treated
 * 进行DID估计，并使用稳健标准误
 reg fte did,r
 reg fte t treated did,r

Linear regression                               Number of obs     =        801
                                                F(3, 797)         =       1.43
                                                Prob > F          =     0.2330
                                                R-squared         =     0.0080
                                                Root MSE          =      9.003

------------------------------------------------------------------------------
             |               Robust
         fte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |   -2.40651   1.594091    -1.51   0.132    -5.535623    .7226031
     treated |  -2.883534   1.403338    -2.05   0.040    -5.638209   -.1288592
         did |   2.913982   1.736818     1.68   0.094    -.4952963    6.323261
       _cons |   19.94872   1.317281    15.14   0.000     17.36297    22.53447
------------------------------------------------------------------------------
/*上述结果显示，政策效应（did）在10%的显著性水平上显著，且系数为正（2.914），表明最低工资法案政策实施后，
快餐店的雇佣人数不会减少，反而会在一定程度上增多。不过，这个结论的未考虑其他控制变量的影响。
接着我们引入快餐品牌的虚拟变量作为控制变量，再次回归
*/
reg fte t treated did bk kfc roys,r


Linear regression                               Number of obs     =        801
                                                F(6, 794)         =      57.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1878
                                                Root MSE          =     8.1617

------------------------------------------------------------------------------
             |               Robust
         fte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           t |  -2.402678   1.410265    -1.70   0.089    -5.170966    .3656108
     treated |  -2.323906   1.253701    -1.85   0.064    -4.784867    .1370549
         did |    2.93502   1.543422     1.90   0.058    -.0946504     5.96469
          bk |   .9168795   .9382545     0.98   0.329    -.9248729    2.758632
         kfc |  -9.204856   .8991089   -10.24   0.000    -10.96977   -7.439945
        roys |  -.8970458   1.041071    -0.86   0.389    -2.940623    1.146532
       _cons |   21.16069   1.307146    16.19   0.000     18.59482    23.72656
------------------------------------------------------------------------------
/*上述结果显示，引入控制变量后，并未改变政策效应的方向，反而提高了政策效应的显著性。
这一小节，主要描述了最简单的双重差分模型的操作步骤，可以让读者快速入门DID，下一章节将描述一个稍微复杂一点的
DID研究案例。
*/

//3 双重差分模型进阶案例——政策评估的标准化操作流程

/*在应用双重差分模型的研究中，除了前述案例的政策效应评估外，还需对数据进行平行趋势检验和安慰剂检验。本案例，将完整的介绍整
个双重差分模型应用的流程。本节案例采用普林斯顿大学Oscar Torres-Reyna教授[2]构建的DID虚拟数据集进行演示分析，
该数据集假设1994年在E、F、G三个国家实施了一项政策，并与相似的A、B、C、D四个国家为控制组。
数据集共包含country、year、y、x1、 x2、 x3、 opinion 7个变量，其中y为被解释变量，x1-x3为连续型的自变量，
opinion为分类型自变量。
*/
//3.1 DID估计

* 首先，根据year和country变量生成实验期变量t和实验组变量treated，并生成政策效应的交互项，然后进行回归。

use Panel101.dta, clear
* 生成实验期变量，1994年赋值为1，否则为0
gen time = (year>=1994) & !missing(year)

* 生成实验组变量，前4个国家为控制组，赋值为0，否则为1
gen treated = (country>4) & !missing(country)

* 生成交互项
gen did = time*treated

* DID估计，并使用稳健标准误
reg y time treated did, r

Linear regression                               Number of obs     =         70
                                                F(3, 66)          =       2.17
                                                Prob > F          =     0.0998
                                                R-squared         =     0.0827
                                                Root MSE          =     3.0e+09

------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        time |   2.29e+09   9.00e+08     2.54   0.013     4.92e+08    4.09e+09
     treated |   1.78e+09   1.05e+09     1.70   0.094    -3.11e+08    3.86e+09
         did |  -2.52e+09   1.45e+09    -1.73   0.088    -5.42e+09    3.81e+08
       _cons |   3.58e+08   7.61e+08     0.47   0.640    -1.16e+09    1.88e+09
------------------------------------------------------------------------------
* 结果显示，政策实施具有负效应，且在10%的显著性水平上显著。考虑加入x1-x3和opinion控制变量，再进行DID估计：

reg y time treated did x1-x3 i.opinion, r

Linear regression                               Number of obs     =         70
                                                F(9, 60)          =       2.00
                                                Prob > F          =     0.0551
                                                R-squared         =     0.1803
                                                Root MSE          =     2.9e+09

------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        time |   2.17e+09   9.48e+08     2.29   0.026     2.74e+08    4.07e+09
     treated |   2.54e+09   1.16e+09     2.18   0.033     2.08e+08    4.87e+09
         did |  -3.19e+09   1.53e+09    -2.09   0.041    -6.25e+09   -1.31e+08
          x1 |   7.50e+08   9.41e+08     0.80   0.428    -1.13e+09    2.63e+09
          x2 |   1.38e+07   3.22e+08     0.04   0.966    -6.30e+08    6.57e+08
          x3 |  -2.21e+08   2.81e+08    -0.79   0.434    -7.83e+08    3.40e+08
             |
     opinion |
      Agree  |  -1.87e+09   1.41e+09    -1.32   0.190    -4.70e+09    9.56e+08
      Disag  |   1.08e+09   8.44e+08     1.28   0.206    -6.09e+08    2.77e+09
  Str disag  |  -3.15e+08   8.43e+08    -0.37   0.710    -2.00e+09    1.37e+09
             |
       _cons |   1.37e+08   9.19e+08     0.15   0.882    -1.70e+09    1.97e+09
------------------------------------------------------------------------------
* 上述结果显示，加入控制变量后，模型的拟合优度更高，且did估计系数的显著性从10%提高至5%，表明确实产生了政策效应。

//3.2 平行趋势检验

/*平行趋势检验的主要目的是验证在政策实施前，实验组和控制组是否存在显著性差异，即与实验组特征相似才可以作为控制组。
平行趋势检验一般有画时间趋势图和时间研究法两种方法，时间趋势图是一种比较直观的方法，不够严谨，其将控制组和对照
组的因变量（y）的均值共同画在一幅图中，凭研究者直观的感受判定是否存在显著性差异。相比于时间趋势图:
  时间研究法，则更为准确，即生成年份的虚拟变量后于treat变量做交互项，然后进行回归。如果政策实施前，每个交互项的
系数不显著的异于0，则表示控制组合对照组不存在显著性差异。故本小节用时间研究法进行平行趋势检验。
*/
* 生成时间的序次变量
gen period = year - 1994
* 数据集共包含10年，其中政策实施前4年，实施后9年
* 将政策实施前的年份与treated做交互
forvalues i =4(-1)1{
gen pre_`i' = (period == -`i' & treated ==1)
}
* 将政策实施的年份（1994）与treated做交互
gen current = (period == 0 & treated ==1)
* 将政策实施后的年份与treated做交互
forvalues j =1(1)5{
gen time_`j' = (period == `j'&treated ==1)
}
* 进行固定效用回归
 
 xtreg y time pre_4 pre_3 pre_2  current time_* i.year,fe

Fixed-effects (within) regression               Number of obs     =         70
Group variable: country                         Number of groups  =          7

R-sq:                                           Obs per group:
     within  = 0.4468                                         min =         10
     between = 0.0116                                         avg =       10.0
     overall = 0.3690                                         max =         10

                                                F(18,45)          =       2.02
corr(u_i, Xb)  = -0.0101                        Prob > F          =     0.0288

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        time |   1.38e+09   1.79e+09     0.77   0.447    -2.24e+09    4.99e+09
       pre_4 |   1.88e+09   2.74e+09     0.69   0.496    -3.64e+09    7.40e+09
       pre_3 |   9.79e+08   2.74e+09     0.36   0.723    -4.54e+09    6.50e+09
       pre_2 |   2.39e+09   2.74e+09     0.87   0.388    -3.13e+09    7.91e+09
     current |  -3.53e+08   2.74e+09    -0.13   0.898    -5.87e+09    5.17e+09
      time_1 |  -6.69e+09   2.74e+09    -2.44   0.019    -1.22e+10   -1.17e+09
      time_2 |  -4.52e+08   2.74e+09    -0.16   0.870    -5.97e+09    5.07e+09
      time_3 |   7.73e+08   2.74e+09     0.28   0.779    -4.75e+09    6.29e+09
      time_4 |  -2.98e+09   2.74e+09    -1.09   0.283    -8.50e+09    2.54e+09
      time_5 |   2.46e+09   2.74e+09     0.90   0.375    -3.06e+09    7.98e+09
             |
        year |
       1991  |   1.00e+09   1.79e+09     0.56   0.579    -2.61e+09    4.62e+09
       1992  |   4.28e+08   1.79e+09     0.24   0.813    -3.19e+09    4.04e+09
       1993  |   4.00e+09   1.79e+09     2.23   0.031     3.90e+08    7.62e+09
       1994  |   3.24e+09   1.79e+09     1.81   0.078    -3.74e+08    6.85e+09
       1995  |   3.84e+09   1.79e+09     2.14   0.038     2.24e+08    7.45e+09
       1996  |   2.04e+09   1.79e+09     1.13   0.262    -1.58e+09    5.65e+09
       1997  |   2.82e+09   1.79e+09     1.57   0.123    -7.95e+08    6.43e+09
       1998  |   1.70e+09   1.79e+09     0.95   0.349    -1.91e+09    5.31e+09
       1999  |          0  (omitted)
             |
       _cons |  -8.01e+08   1.52e+09    -0.53   0.600    -3.86e+09    2.25e+09
-------------+----------------------------------------------------------------
     sigma_u |  1.330e+09
     sigma_e |  2.537e+09
         rho |  .21558238   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6, 45) = 2.66                       Prob > F = 0.0269
/* 上述结果显示，pre4至pre2均不显著，表示实验组和控制组在政策实施前并无显著差异。其次，政策实施后，仅有time_1的系数显著，
表明政策效应仅出现在政策实施后一年，1996年及以后实验组和控制组未受到政策的影响。
*/

* 此外，还可以将上述结果的系数和置信区间画出来，以更直观的形式展示结果，代码如下：
est sto reg 
coefplot reg,keep(pre_* current time_*) vertical recast(connect) yline(0) xline(4,lp(dash))/// 
ytitle("政策效应") ///
xtitle("时期 （pre_*政策前，current政策年，time_*政策后）")

// 3.3 安慰剂检验

/*3.1节和3.2节结果显示，政策的实施确实产生了政策效应，且政策实施前实验组和控制组不存在显著性差异，但是通过DID估计出
的政策效应是否受其他政策或因素的影响是未知的，因此需要进行安慰剂检验。

安慰剂检验最常用的方法就是将研究样本缩小至政策实施前，并随机设定一个政策实施年份。本文的研究样本是1990-1999年，政策
实施年份为1994年，故本次安慰剂假设政策时间发生在1994年以前。与文献[3]类似，将研究样本设定在1990-1994间，并将政策
年份设定在1992年。
*/
gen time_new = (year>=1992) & !missing(year)
gen treated_new = (country>4) & !missing(country)
gen did_new = time_new*treated_new
reg y time_new treated_new did_new x1-x3 i.opinion if year<=1994, r

Linear regression                               Number of obs     =         35
                                                F(9, 25)          =       1.87
                                                Prob > F          =     0.1053
                                                R-squared         =     0.3519
                                                Root MSE          =     2.8e+09

------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    time_new |   2.04e+09   1.55e+09     1.32   0.200    -1.15e+09    5.24e+09
 treated_new |   2.80e+09   1.37e+09     2.04   0.052    -2.67e+07    5.62e+09
     did_new |  -7.95e+07   1.91e+09    -0.04   0.967    -4.00e+09    3.84e+09
          x1 |  -4.84e+08   1.37e+09    -0.35   0.727    -3.30e+09    2.34e+09
          x2 |  -1.44e+08   5.28e+08    -0.27   0.787    -1.23e+09    9.43e+08
          x3 |  -1.06e+09   8.96e+08    -1.18   0.250    -2.90e+09    7.90e+08
             |
     opinion |
      Agree  |  -1.85e+09   1.51e+09    -1.22   0.233    -4.97e+09    1.27e+09
      Disag  |   1.37e+09   1.60e+09     0.86   0.400    -1.92e+09    4.65e+09
  Str disag  |   2.76e+07   1.27e+09     0.02   0.983    -2.60e+09    2.65e+09
             |
       _cons |   1.18e+08   1.26e+09     0.09   0.926    -2.48e+09    2.71e+09
------------------------------------------------------------------------------
* 结果显示，did_new的系数为负，但是不显著，表明可以排除其他潜在的不可观测因素的影响，即本文估计出的政策效应是稳健的。

// 4 结语

/* 本文分别用Card and Kruger和Oscar Torres-Reyna两份数据集，应用了双重差分模型，尤其是对平行趋势检验和安慰剂检验
进行了充分的讲解说明，并利用stata进行了实现。在实际应用中，安慰剂检验还可以用其他方法，包括随机选择实验组、 替换样本安慰
剂检验、替换变量安慰剂检验等，进行多个安慰剂检验能够让政策评估效应更稳健。同时，在进行政策评估时，尽可能考虑全面可能存在的
控制变量，以期排除这些因素的影响。

参考文献
[1] Card, D., Krueger, A. "Minimum Wages and Employment: A Case Study of the Fast-Food Industry in
 New Jersey and Pennsylvania". The American Economic Review, Vol. 84, No. 4 (Sep., 1994), pp. 772-793.

[2] Oscar Torres-Reyna. Differences-in-Differences(using Stata). August 2015,
 http://www.princeton.edu/~otorres/DID101.pdf.

[3]吕越, 陆毅, 吴嵩博,等. "一带一路"倡议的对外投资促进效应——基于2005—2016年中国企业绿地投资的双重差分检验[J]. 经济研究,
 2019, v.54;No.624(09):189-204.
*/


************DID如何做平行趋势检验******************
*（参考知乎：https://zhuanlan.zhihu.com/p/137443864?utm_source=qq&utm_id=0）
/*想要使用DID就要满足平行趋势假设，因为只有当处理组和控制组在政策前足够相似才能够保证DID估计出的是政策的因果效应。

第一种方法就是绘制处理组和控制组的时间趋势图。从图中可以看出，在政策时点之前，处理组和控制组还是具有那么一丢丢的相似
性，y都保持着相似的增长趋势，当然这种趋势也只能说有一点相似不能说相同，可能是构造出来的数据的效果不是特别好。总之，
这种方法仅凭肉眼观察较为粗糙，想要得到更为准确、科学的结论还是应该使用事件研究法。
*/
egen mean_y=mean(y), by(year treat)
graph twoway (connect mean_y year if treat==1,sort) (connect mean_y year if treat==0,sort lpattern(dash)), ///
xline(1994,lpattern(dash) lcolor(gray)) ///
ytitle("y") xtitle("年度") ///
ylabel(,labsize(*0.75)) xlabel(,labsize(*0.75)) ///
legend(label(1 "处理组") label( 2 "控制组")) ///图例
xlabel(1990 (1) 1999)  graphregion(color(white)) //白底

/*
第二种方法就是事件研究法，我们首先生成年份虚拟变量与处理组虚拟变量的交互项，将这些交互项作为解释变量进行回归。
交互项的系数反映的就是特定年份处理组和控制组之间的差异，我们特别希望看到的就是政策时点前的虚拟变量与处理组虚
拟变量的交互项的系数不显著。不过，在这里要特别注意是我们需要选择一期作为参照组，否则会有完全共线性问题（一般都是drop掉-1期）。

*/
gen policy = year - 1994
tab policy
replace policy = -3 if policy < -3
replace policy = 3 if policy > 3
* 首先生成年份虚拟变量与实验组虚拟变量的交互项
forvalues i = 3(-1)1{
  gen pre_`i' = (policy == -`i' & treat == 1) 
}

gen current = (policy == 0 & treat == 1)

forvalues j = 1(1)3{
  gen  post_`j' = (policy == `j' & treat == 1)
}
* 将政策前第一期作为基准组，很重要！！！
drop pre_1 
* 将这些交互项作为解释变量进行回归
xtreg y  pre_* current  post_* i.year, fe r 

------------------------------------------------------------------------------
             |               Robust
           y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       pre_3 |   1.43e+09   2.65e+09     0.54   0.609    -5.05e+09    7.91e+09
       pre_2 |   2.39e+09   2.47e+09     0.97   0.371    -3.66e+09    8.44e+09
     current |  -3.53e+08   1.05e+09    -0.34   0.747    -2.91e+09    2.21e+09
      post_1 |  -6.69e+09   2.88e+09    -2.33   0.059    -1.37e+10    3.50e+08
      post_2 |  -4.52e+08   2.65e+09    -0.17   0.870    -6.94e+09    6.04e+09
      post_3 |   8.41e+07   3.20e+09     0.03   0.980    -7.75e+09    7.91e+09
-------------+----------------------------------------------------------------

/*接下来就是进一步通过直观图形方式，对政策在不同年份之间的动态经济效应进行呈现。从图中可以看出，交互项
的系数在政策前并不显著异于0（95%的置信区间包含了0值），这说明政策时点前处理组和控制组之间不存在显著差
异，即满足平行趋势的假设；而政策后第一年的系数显著为负，但很快又回到0附近，说明政策在推行后第一年产生了
一个显著的负效应，但随后又很快消失了。
*/

coefplot, baselevels ///
keep(pre_* current post_*) ///
vertical ///转置图形
yline(0,lcolor(edkblue*0.8)) ///加入y=0这条虚线 
xline(3, lwidth(vthin) lpattern(dash) lcolor(teal)) ///
ylabel(,labsize(*0.75)) xlabel(,labsize(*0.75)) ///
ytitle("政策动态效应", size(small)) ///加入Y轴标题,大小small
xtitle("政策时点", size(small)) ///加入X轴标题，大小small 
addplot(line @b @at) ///增加点之间的连线
ciopts(lpattern(dash) recast(rcap) msize(medium)) ///CI为虚线上下封口
msymbol(circle_hollow) ///plot空心格式
scheme(s1mono)
*由于以政策时点前的第1期作为基准组，因此图中没有-1期的数据

