*****************中介效应*****************
***** 一、逐步检验*****
y = cx + e
M = ax + e1
y = c'x + bM + e2
*1.逻辑清晰，简单易懂
*2.容易导致错误，c可能不显著,但是中介效应的作用下，c‘反而显著：工人的智商x和犯错无数y，中介为无聊程度m
*****二、系数乘积检验法****
* 2.1 sobel检验：a*b要服从正态分布很难满足，即使啊a，b都服从正态分布也很难满足；
* 2.2 bootstrap检验：重抽样多次构造置信区间，更有效
* 2.3 系数差异检验：ab = c - c',与乘积法基本等价，但是更容易犯错误

*****案例：数据基本描述：这是一组有关大型百货公司销售人员的数据，我们用来讨论经理的激励与员工工作表现之间的关系，基本假设是：经理的激励 (support) 可能通过影响员工的工作满意度 (satis) 而影响员工的工作表现 (perform)。
cd /users/zhulu/files/data/r15
use gsem_multmed,clear
sum 
***1.首先进行逐步检验法
reg perform support
reg satis support
reg perform support satis

. reg perform support //y = cx
------------------------------------------------------------------------------
     perform | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     support |   .8217557   .0404849    20.30   0.000     .7423427    .9011687 //c = 0.822，总效应 = 直接效应（0.616）+ 中介效应（0.206）
------------------------------------------------------------------------------

. reg satis support  //M = ax
------------------------------------------------------------------------------
       satis | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     support |   .2288945   .0305251     7.50   0.000     .1690181    .2887709 //a = 0.229，
------------------------------------------------------------------------------

. reg perform support satis //y = c'x + bM
------------------------------------------------------------------------------
     perform | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     support |   .6161077   .0303447    20.30   0.000      .556585    .6756303 //c' = 0.616，直接效应，和总效应相比变小
       satis |   .8984401   .0252156    35.63   0.000     .8489785    .9479017 //b  = 0.898
------------------------------------------------------------------------------ //ab = 0.898*0.229 = 0.206，中介效应

/* 完整结果解读
经理的激励对员工表现的总效应是 0.822，效果显著；
经理激励对员工表现的直接效应为 0.616，虽然结果显著，但是影响并不大；
经理激励通过工作满意度对员工表现发挥的间接效应为 0.206 (=0.898 * 0.229)，也就是我们说的中介效应；
中介效应在总效应中占比 25.02% (=0.898 * 0.229 / 0.822)；
传统的逐步检验回归系数方法受到了很多挑战，建议进一步进行其他方法的检验，稳健中介效应效果。 */

***** 二、sobel 检验*****
//第一步：安装 segmediation 命令包 
findit sgmediation
//第二步：进行分析
sgmediation perform, mv(satis) iv(support) //命令会自动检验变量之间的关系路径，并提供中介效应在总效应中的占比和显著值。如果需要加入控制变量，sgmediation y, mv(m) iv(x) cv(c)。具体结果如下：
. sgmediation perform, mv(satis) iv(support)    //用 sobel 方法检验中介变量

Model with dv regressed on iv (path c)     //这里，Stata 自动检验经理激励和员工工作表现之间的路径，形成路径 c

------------------------------------------------------------------------------
     perform |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     support |   .8217557   .0404849    20.30   0.000     .7423427    .9011687
------------------------------------------------------------------------------

Model with mediator regressed on iv (path a)     //这里，Stata 检验中介变量 (工作满意度) 与自变量 (经理激励) 之间的关系，形成路劲 a

------------------------------------------------------------------------------
       satis |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     support |   .2288945   .0305251     7.50   0.000     .1690181    .2887709
------------------------------------------------------------------------------

Model with dv regressed on mediator and iv (paths b and c')   //加入中介变量， Stata 再次检验经理支持对员工工作表现的影响

------------------------------------------------------------------------------
     perform |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       satis |   .8984401   .0252156    35.63   0.000     .8489785    .9479017
     support |   .6161077   .0303447    20.30   0.000      .556585    .6756303
------------------------------------------------------------------------------

Sobel-Goodman Mediation Tests      //进行 Sobel 检验，原假设 $H0 : ab=0$

                     Coef         Std Err     Z           P>|Z|
Sobel               .20564799    .02802571   7.338      2.172e-13    //我们需要关注这个部分的 P 值，这里的 P<0.05 则代表拒绝原假设，中介效应成立
Goodman-1 (Aroian)  .20564799    .02803628   7.335      2.216e-13
Goodman-2           .20564799    .02801514   7.341      2.127e-13

                    Coef      Std Err    Z          P>|Z|
a coefficient   =  .228894   .030525   7.49857    6.5e-14    // 这里分别提供了输入命令三个变量之间的关系路径系数
b coefficient   =   .89844   .025216   35.6304          0
Indirect effect =  .205648   .028026   7.33783    2.2e-13
  Direct effect =  .616108   .030345   20.3036          0
   Total effect =  .821756   .040485   20.2979          0

Proportion of total effect that is mediated:  .25025442      //这里 Stata 直接帮我们计算出中介效应在总效应中的占比 25.03%
Ratio of indirect to direct effect:           .3337858
Ratio of total to direct effect:              1.3337858

*****三、bootstrap检验*****
bootstrap r(ind_eff) r(dir_eff), reps(500) : sgmediation perform, mv(satis) iv(support) 
//结果如下：
      Command: sgmediation perform, mv(satis) iv(support)
        _bs_1: r(ind_eff)
        _bs_2: r(dir_eff)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _bs_1 |    .205648    .025995     7.91   0.000     .1546987    .2565972
       _bs_2 |   .6161077   .0302057    20.40   0.000     .5569057    .6753097
------------------------------------------------------------------------------

//这里计算直接效应和间接效应的置信区间
estat bootstrap, percentile bc //结果如下：

Bootstrap results                               Number of obs      =      1500
                                                Replications       =       500

      command:  sgmediation perform, mv(satis) iv(support)
        _bs_1:  r(ind_eff)
        _bs_2:  r(dir_eff)

------------------------------------------------------------------------------
             |    Observed               Bootstrap
             |       Coef.       Bias    Std. Err.  [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .20564799  -.0008603   .02823879    .1478535   .2641403   (P)
             |                                       .1528905   .2683623  (BC)
       _bs_2 |   .61610768   .0003294   .03059962     .559106   .6745357   (P) //我们需要关注这个地方的置信区间，很显然不包含 0 ，中介效应成立
             |                                       .5592248   .6750107  (BC)
------------------------------------------------------------------------------
(P)    percentile confidence interval
(BC)   bias-corrected confidence interval

*****四、结构方程模型*****
//Stata 也可以通过结构方程 (sem) 或者广义线性回归 (gsem) 的方式检验中介效应。分为两步：

sem (perform <- satis support) (satis <- support)   //进行模型估计
estat teffects    //计算中介效应

*****五、类别变量的中介效应检验*****
/* 通常的中介效应模型，假设自变量、中介变量和因变量均为连续变量，对于连续变量的中介效应分析本文 3.2 中的方法均可使用。当自变量 X 为分类变量时，可以先通过生成哑变量的方法对自变量进行处理，之后的中介效应分析方法与连续变量的步骤完全相同。但是，对于因变量 Y 为分类变量或者中介变量 M 为类别变量的情况，研究中使用的相对较少，下文中我们收集了几个处理因变量 Y 或者中介变量 M 为类别变量的分析方法。 */

* 广义结构方程方法
//对于因变量 Y 是二分类变量，中介变量 M 为连续变量的情况，可以考虑使用 gsem 模型检验中介效应。

//调用数据并定义变量
//下文中为了举例用广义结构方程方法分析类别变量的中介效应分析，我们将因变量 Y 处理为二分类变量
gen perform_gr2=.
replace perform_gr2=0 if perform<5
replace perform_gr2=1 if perform>=5&perform!=.
tab perform_gr2,missing  //将因变量处理为类别变量，perform_gr2=0 代表员工工作表现不好， perform_gr2=1 代表员工工作表现好

gsem (perform_gr2 <- support satis) (satis <- support)      //模型估计
gsem, coeflegend        //计算效应
nlcom _b[perform_gr2:satis]*_b[satis:support]                            //计算间接效应：a*b
nlcom _b[perform_gr2:support]+_b[perform_gr2:satis]*_b[satis:support]    //计算总效应  : a*b + c'

* 计算置信区间 CI
/* 对于因变量 Y 是多分类变量，中介变量 M 为多分类变量的情况，可以考虑通过直接计算置信区间 CI 的方式进行中介效应分析。下文中我们结合 Stata 和 R 语言为大家提供一种多阶段计算置信区间 CI 的方法，用以分析类别变量的中介效应。 */

//下文中为了解释方便，我们将因变量 Y 处理为三分类变量，中介变量 M 处理为二分类变量

gen satis_gr2=.
replace satis_gr2=0 if satis<=0
replace satis_gr2=1 if satis>=0&satis!=.
tab satis_gr2,missing     //将中介变量处理为类别变量，satis_gr2=0 代表员工工作满意度低，satis_gr2=1 代表员工工作满意度高

gen perform_gr3=.
replace perform_gr3=1 if perform<4.5
replace perform_gr3=2 if perform>=4.5&perform<5.5
replace perform_gr3=3 if perform>=5.5&perform!=.
tab perform_gr3,missing  //将因变量处理为类别变量，perform_gr3=1 代表员工工作表现不好， perform_gr3=2 代表员工工作表现一般，perform_gr3=3 代表员工工作表现优秀

//Tofighi & MacKinnon (2011) 在文章中介绍了 RMediation 程序包，可以通过 R语言实现上述多个建立置信区间检验中介效应的方法。

//具体实施步骤
//第一步，我们需要通过 Stata 对变量之间关系进行分析。这一步可以用逐步检验回归系数的方法进行，这里我们采用 two-step regression (Zhao, Lynch et al. 2010)
logit satis_gr2 support                         //分析中介变量和自变量之间的关系
mlogit perform_gr3 support satis_gr2,base(1)    //控制中介变量后，看自变量和因变量之间的关系

//第二步：联网状态，在 R 语言中安装程序包

install.packages("RMediation")
library (package = "RMediation")

//第三步，使用 R 语言 RMediation 软件包进行计算

medci (mu.x = 0.543, mu.y = 1.533, se.x = 0.105, se.y = 0.151, rho = 0, alpha = 0.1, type = "prodclin")
/* $`95% CI`
[1] 0.5456374 1.1411552

$Estimate
[1] 0.832419

$SE
[1] 0.1813394
结果中，相较于员工表现不好，员工是否满意对于经理激励和员工工作表现一般的中介作用置信区间为 (0.546, 1.141)，区间不包含 0 ，中介效应成立。 */

medci (mu.x = 0.543, mu.y = 3.563, se.x = 0.105, se.y = 0.209, rho = 0, alpha = 0.1, type = "prodclin")
/* $`95% CI`
[1] 1.301461 2.588863

$Estimate
[1] 1.934709

$SE
[1] 0.3915647
结果中，相较于员工员工表现不好，员工是否满意对于经理激励和员工工作表现优秀的中介作用置信区间为 (1.301, 2.589)，区间不包含 0 ，中介效应成立。 */

/* 
medci (mu.x = 0.543, mu.y = 1.533, se.x = 0.105, se.y = 0.151, rho = 0, alpha = 0.1, type = "prodclin") 代表，相较于员工表现不好，员工是否满意对于经理激励和员工工作表现一般的中介作用置信区间； medci (mu.x = 0.543, mu.y = 3.563, se.x = 0.105, se.y = 0.209, rho = 0, alpha = 0.1, type = "prodclin") 代表，相较于员工员工表现不好，员工是否满意对于经理激励和员工工作表现优秀的中介作用的置信区间。在两个命令中，
mu.x 和 se.x 分别对应中介模型中的 a 路径的估计值和标准误，根据第一步 Stata 命令 logit satis_gr2 support 输出结果，我们可以看到，mu.x =  = 0.543, se.x =  = 0.105
mu.y 和 se.y 分别对应中介模型中的 b 路径的估计值和标准误，根据第二步 Stata 命令 mlogit perform_gr3 support satis_gr2,base(1) 输出结果，我们可以看到，由于 因变量员工的工作表现是三分类变量，mu.y1 =  = 1.533 , se.y1 =  = 0.151 , mu.y2 =  = 3.563 , se.y2 =  = 0.209
rho 指定两个变量之间的相关性，默认值为 0
alpha 是置信区间 CI 的显著性水平，默认值为 0.05
type 是类型，默认值为 "PRODCLIN" 程序 */

/* 拓展：type 是类型，默认值为 "PRODCLIN" 程序，还可选 "DOP" (RDOP 程序)、"MC" (蒙特卡罗方法)、"asymp" (AND方法) 或 "all" (使用所有四种方法)。需要注意，参数类型的值必须用单引号或双引号括起来。 */



*****六、总结*****
/* 
1. 中介变量是联系两个自变量 x 和因变量 y 之间的纽带，理论上来说，可以通过中介变量研究变量关系的内部机制。
2. 传统的逐步检验回归系数方法虽然受到了很多挑战，但仍然广泛使用，建议使用逐步检验回归系数方法检验出在部分中介效应的情况下，进一步使用 Bootrap 方法对中介效应进行检验。
3. 现有研究对于类别变量的中介效应讨论较少，可以通过多阶段方法建立置信区间，检验类别变量的中介效应。 
*/
