*****受限别解释变量模型
/*
1. 断尾truncated:只有y>c的数据才能被观测到,规模以上企业truncreg
0断尾:0断尾泊松回归和负二项回归,只有大于0的数据,ztnb,ztp
随机前沿模型:frontier
偶然断尾与样本选择:受过高等教育和冒险精神的亚裔才会选择移民,heckman
2. 归并censored:y>c时所有的y都归并为c,tobit,clad 
3. 相关命令,加xt即为面板数据
tobit
xttobit

intreg
xtintreg

truncreg

heckman
xtheckman
*/

***1.断尾回归
cd e:\data
use laborsub.dta,clear
tab lfp

1 if woman |
  worked in |
       1975 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        100       40.00       40.00 //结果显示250个人中100人不工作，工作时间为0；
          1 |        150       60.00      100.00
------------+-----------------------------------
      Total |        250      100.00
//作为对照，先对有工作的150样本进行OLS回归：
reg whrs kl6 k618 wa we if whrs > 0

------------------------------------------------------------------------------
        whrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         kl6 |  -421.4822   167.9734    -2.51   0.013    -753.4748   -89.48953
        k618 |  -104.4571   54.18616    -1.93   0.056    -211.5538    2.639668
          wa |  -4.784917   9.690502    -0.49   0.622     -23.9378    14.36797
          we |   9.353195   31.23793     0.30   0.765    -52.38731     71.0937
       _cons |   1629.817   615.1301     2.65   0.009     414.0371    2845.597
------------------------------------------------------------------------------
//然后在whrs=0，左边断尾进行回归：
truncreg whrs kl6 k618 wa we,ll(0) nolog

------------------------------------------------------------------------------
        whrs |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         kl6 |  -803.0042   321.3614    -2.50   0.012    -1432.861   -173.1474
        k618 |   -172.875   88.72898    -1.95   0.051    -346.7806    1.030579
          wa |  -8.821123   14.36848    -0.61   0.539    -36.98283    19.34059
          we |   16.52873   46.50375     0.36   0.722    -74.61695    107.6744
       _cons |    1586.26    912.355     1.74   0.082    -201.9234    3374.442
-------------+----------------------------------------------------------------
      /sigma |   983.7262   94.44303    10.42   0.000     798.6213    1168.831
------------------------------------------------------------------------------
//对比以上回归结果，断尾回归和子样本进行OLS回归，有较大的不同。

***2.零断尾泊松回归和负二项回归
cd "e:\data"
use CRIME1.dta,clear
drop if narr86 == 0
//零断尾泊松回归：
ztp narr86 pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60,r nolog

***3.随机前言模型
cd "e:\data"
use greene9.dta,clear
reg lnv lnk lnl,r
//估计随机前沿半正态模型：
frontier lnv lnk lnl,nolog
Stoc. frontier normal/half-normal model         Number of obs     =         25
                                                Wald chi2(2)      =     743.71
Log likelihood =  2.4695222                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
         lnv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lnk |   .2585478    .098764     2.62   0.009     .0649738    .4521218
         lnl |   .7802451   .1199399     6.51   0.000     .5451672    1.015323
       _cons |   2.081135    .281641     7.39   0.000     1.529128    2.633141
-------------+----------------------------------------------------------------
    /lnsig2v |   -3.48401   .6195353    -5.62   0.000    -4.698277   -2.269743
    /lnsig2u |  -3.014599    1.11694    -2.70   0.007    -5.203761   -.8254368
-------------+----------------------------------------------------------------
     sigma_v |   .1751688   .0542616                      .0954514    .3214633
     sigma_u |   .2215073   .1237052                       .074134    .6618486
      sigma2 |   .0797496   .0426989                     -.0039388     .163438
      lambda |   1.264536   .1678684                      .9355204    1.593552
------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.43               Prob >= chibar2 = 0.256

***4.偶然断尾与样本选择
cd e:/data
use womenwk.dta,clear
heckman lw education age children,select(age married children education)
//结果如下：
Heckman selection model                         Number of obs     =      2,000
(regression model with sample selection)              Selected    =      1,343
                                                      Nonselected =        657

                                                Wald chi2(3)      =     454.78
Log likelihood = -1052.857                      Prob > chi2       =     0.0000

------------------------------------------------------------------------------
          lw |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lw           |
   education |   .0397189   .0024525    16.20   0.000     .0349121    .0445256
         age |   .0075872   .0009748     7.78   0.000     .0056767    .0094977
    children |  -.0180477   .0064544    -2.80   0.005    -.0306981   -.0053973
       _cons |   2.305499   .0653024    35.30   0.000     2.177509     2.43349
-------------+----------------------------------------------------------------
select       |
         age |   .0350233   .0042344     8.27   0.000     .0267241    .0433225
     married |   .4547724   .0735876     6.18   0.000     .3105434    .5990014
    children |   .4538372   .0288398    15.74   0.000     .3973122    .5103621
   education |   .0565136   .0110025     5.14   0.000     .0349492    .0780781
       _cons |  -2.478055   .1927823   -12.85   0.000    -2.855901   -2.100208
-------------+----------------------------------------------------------------
     /athrho |   .3377674   .1152251     2.93   0.003     .1119304    .5636045 //rho为相关系数，绝对值小于1，双曲反正切便于求解；
    /lnsigma |  -1.375543   .0246873   -55.72   0.000    -1.423929   -1.327156 //sigma必须为正，取对数便于MLE求解；
-------------+----------------------------------------------------------------
         rho |   .3254828   .1030183                      .1114653    .5106469
       sigma |   .2527024   .0062385                      .2407662    .2652304
      lambda |   .0822503   .0273475                      .0286501    .1358505
------------------------------------------------------------------------------
LR test of indep. eqns. (rho = 0):   chi2(1) =     5.53   Prob > chi2 = 0.0187 
//似然比检验，原假设：\rho=0（不需要使用样本选择模型），据拒绝原假设则应该使用样本选择模型；

heckman lw education age children,select(age married children education) twostep //两步法，和上面的估计结果很接近。

***5 归并回归
cd e:/data
use womenwk.dta,clear
hist lwf //通过直方图可以看到，lwf在很多观测点取值为0，对此进行左归并点为0的归并回归；
reg lwf age married children education,r
estimates store ols
tobit lwf age married children education,ll(0)
estimates store tobit
//tobcm,p
clad lwf age married children education,ll(0)
estimates store clad
esttab ols tobit clad,mtitles //mtitles表示显示列标题为存储名，将三个结果对比；
------------------------------------------------------------
                      (1)             (2)             (3)   
                      ols           tobit            clad   
------------------------------------------------------------
main                                                        
age                0.0364***       0.0522***       0.0307***
                   (9.42)          (9.08)         (10.78)   

married             0.319***        0.484***        0.271***
                   (4.49)          (4.68)          (5.27)   

children            0.331***        0.486***        0.153*** //如果tobit模型设定正确，则tobit和clad相差不大（满足正态性和同方差假定）
                  (18.25)         (15.33)          (9.59)    //如果相差较大，则认为tobit模型设定有误，倾向于使用clad模型。

education          0.0843***        0.115***       0.0748***
                   (7.89)          (7.62)          (9.93)   

_cons              -1.078***       -2.808***        0.166   
                  (-6.49)        (-10.67)          (1.32)   
------------------------------------------------------------
/                                                           
var(e.lwf)                          3.507***                
                                  (23.40)                   
------------------------------------------------------------
N                    2000            2000            2000   
------------------------------------------------------------

***6.归并数据的两部分模型
cd e:/data
use womenwk.dta,clear
gen lwd = (lwf>0)
probit lwd age married children education,nolog

Probit regression                               Number of obs     =      2,000
                                                LR chi2(4)        =     478.32
                                                Prob > chi2       =     0.0000
Log likelihood = -1027.0616                     Pseudo R2         =     0.1889

------------------------------------------------------------------------------
         lwd |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0347211   .0042293     8.21   0.000     .0264318    .0430105
     married |   .4308575    .074208     5.81   0.000     .2854125    .5763025
    children |   .4473249   .0287417    15.56   0.000     .3909922    .5036576
   education |   .0583645   .0109742     5.32   0.000     .0368555    .0798735
       _cons |  -2.467365   .1925635   -12.81   0.000    -2.844782   -2.089948
------------------------------------------------------------------------------

//结果显示，各解释变量对于参加工作的概率有显著正向影响，对于第二部分模型，则使用参加工作的子样本进行OLS回归；
reg lwf age married children education if lwd == 1,r

Linear regression                               Number of obs     =      1,343
                                                F(4, 1338)        =     123.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2570
                                                Root MSE          =     .24733

------------------------------------------------------------------------------
             |               Robust
         lwf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0066617    .000873     7.63   0.000     .0049492    .0083743
     married |  -.0298994    .016201    -1.85   0.065    -.0616815    .0018826
    children |  -.0321762   .0048209    -6.67   0.000    -.0416336   -.0227188
   education |   .0380189   .0021444    17.73   0.000     .0338121    .0422257
       _cons |   2.448392   .0426429    57.42   0.000     2.364738    2.532046
------------------------------------------------------------------------------
//两部分模型和Tobit模型估计结果最大的不同是，married和children变量的系数，显著为负，这说明已婚和孩子数量能提高进入就业市场的概率，
//却显著降低进入就业市场后的工资水平，模型可能依然存在非正态性和异方差，由于是一般回归，则可直接进行常规的异方差检验：
qui reg lwf age married children education if lwd == 1
estat imtest ,white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(13)     =     45.78
         Prob > chi2  =    0.0000 //拒绝同方差的原假设，存在异方差；

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |      45.78     13    0.0000
            Skewness |      37.56      4    0.0000
            Kurtosis |       6.75      1    0.0094
---------------------+-----------------------------
               Total |      90.09     18    0.0000
---------------------------------------------------
//为了检验扰动项的正态性，生成残差，
predict lwf_resid,resid
sktest lwf_resid


                    Skewness/Kurtosis tests for Normality
                                                          ------ joint ------
    Variable |        Obs  Pr(Skewness)  Pr(Kurtosis) adj chi2(2)   Prob>chi2
-------------+---------------------------------------------------------------
   lwf_resid |      2,000     0.0000            .            .              .

//结果也强烈拒绝了正态性的原假设，认为不服从正态分布；
kdensity lwf_resid //画出残差的核密度图，可以明显看出双峰，非正态分布；
//对于线性回归模型，非正态性和异方差性并不影响估计量的异质性和渐进正态性，只要使用异方差稳健标准误即可。

***7.含内生解释变量的Tobit模型
cd e:/data
use laborsup.dta
ivtobit fem_inc fem_educ kids (other_inc=male_educ),ll nolog

Tobit model with endogenous regressors          Number of obs     =        500
                                                   Uncensored     =        228
Limits: lower = 10                                 Left-censored  =        272
        upper = +inf                               Right-censored =          0

                                                Wald chi2(3)      =     117.42
Log likelihood = -3226.0845                     Prob > chi2       =     0.0000

-----------------------------------------------------------------------------------
                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
        other_inc |  -.9045397   .1329761    -6.80   0.000    -1.165168   -.6439113
         fem_educ |    3.27239   .3968708     8.25   0.000     2.494538    4.050243
             kids |  -3.312356   .7218627    -4.59   0.000    -4.727181   -1.897532
            _cons |   19.24735   7.372389     2.61   0.009     4.797732    33.69697
------------------+----------------------------------------------------------------
 corr(e.other_inc,|
        e.fem_inc)|   .2639504   .1165265                      .0248536    .4744837
     sd(e.fem_inc)|   18.35934   1.094702                       16.3344    20.63532
   sd(e.other_inc)|   16.66621   .5270318                      15.66461    17.73186
-----------------------------------------------------------------------------------
Instrumented:  other_inc
Instruments:   fem_educ kids male_educ
-----------------------------------------------------------------------------------
Wald test of exogeneity (corr = 0): chi2(1) = 4.66        Prob > chi2 = 0.0309 //H0:a=0,拒绝原假设，认为存在内生性

//使用两步法，显示第一步的回归结果：
ivtobit fem_inc fem_educ kids (other_inc=male_educ),ll first twostep

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(3, 496)       =     34.36
       Model |  28864.2732         3  9621.42439   Prob > F        =    0.0000
    Residual |  138881.269       496  280.002558   R-squared       =    0.1721
-------------+----------------------------------   Adj R-squared   =    0.1671
       Total |  167745.542       499  336.163411   Root MSE        =    16.733

------------------------------------------------------------------------------
   other_inc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   male_educ |   2.845253   .2838838    10.02   0.000      2.28749    3.403016
    fem_educ |   .3351866   .2837344     1.18   0.238    -.2222829    .8926562
        kids |   .8329056   .5497701     1.52   0.130    -.2472597    1.913071
       _cons |   9.872562   5.049432     1.96   0.051    -.0483506    19.79347
------------------------------------------------------------------------------

Two-step tobit with endogenous regressors         Number of obs   =        500
                                                   Uncensored     =        228
Limits: lower = 10                                 Left-censored  =        272
        upper = +inf                               Right-censored =          0

                                                  Wald chi2(3)    =     117.38
                                                  Prob > chi2     =     0.0000

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   other_inc |  -.9045397   .1330015    -6.80   0.000    -1.165218   -.6438616
    fem_educ |    3.27239   .3969399     8.24   0.000     2.494402    4.050378
        kids |  -3.312356   .7220066    -4.59   0.000    -4.727463   -1.897249
       _cons |   19.24735    7.37392     2.61   0.009     4.794728    33.69997
------------------------------------------------------------------------------
Instrumented:  other_inc
Instruments:   fem_educ kids male_educ
------------------------------------------------------------------------------
Wald test of exogeneity: chi2(1) = 4.64                   Prob > chi2 = 0.0312

